<?php

//配置文件
return [
    'exception_handle'        => '\\app\\api\\library\\ExceptionHandle',
    'FINANCE_KEY'   =>"Z5H6IJV2EDXZ7IZKAHADP1XQBZA11ROZ",
    'finance' =>[
        'status' =>[
            'book_order' =>[
                '10' => '未记账',
                '20' => '记账中',
                '00' => '记账成功',
                '99' => '记账失败'
            ],
            'cash_order' => [
                '10' => '收银中',
                '00' =>'收银成功',
                '99' =>'收银失败'
            ],
            'cash_req' => [
                '10' => '草稿',
                '20' => '审批中',
                '30' => '审批完成',
                '40' => '收银请求中',
                '00' => '收银成功',
                '99' => '收银失败'
            ] 
        ],
        'account_type' => [
            '10' =>'余额',
            '20' =>'绿色积分',
            '30' =>'碳积分:分红权',
            '90' =>'冻结如e卷',
            '91' =>'如e卷'
    
        ],
        'account_object' =>[
            '10' =>'商户',
            '20' =>'代理',
            '30' =>'通道',
            '40' =>'私有',
            '70' =>'合伙人',
            '80' =>'用户'
        ],
    
        'private_account' =>[
            '100210' =>'现金',
            '600110' =>'现金成本',
            '640110' =>'现金利润',
            
            '600120' =>'绿色积分成本',
            '600130' =>'碳积分成本',
            '600190' =>'打车卷成本',
            '600191' =>'可用打车卷成本'
        ],

        'book_category' =>[
            '1' => '资产',
            '2' =>'负债',
            '3' =>'所有者权益',
            '4' => '其它收入',
            '5' =>'主营成本',
            '6' =>'主营收入',
            'ASSET' =>'1',
            'LIABILITIES' =>'2',
            'OWNERS' =>'3',
            'REVENUE' =>'4',
            'EXPENSE' =>'5',
            'INCOME' =>'6'
        ],
        'account_direction' =>[
            '0' => '初始化',
            '10' =>'收入',
            '20' =>'支出' ,
            'INCOME' =>'10',
            'EXPENSE' =>'20'
        ]

    ]



];
